// pages/test/test.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    // index: 1,

    score: [{
        option: [{
            1: -1000,
            2: 10,
            3: -50,
            4: -50,
            5: -100,
            6: -50,
            7: 30,
            8: 50,
            9: 50,
            10: -1000,
            11: -1000,
            12: 30,
            14: 50,
            name: '初中以下'
          },
          {
            1: -1000,
            2: 20,
            3: 0,
            4: 0,
            5: -50,
            6: 10,
            7: 30,
            8: 50,
            9: 50,
            10: -1000,
            11: -1000,
            12: 30,
            14: 50,
            name: '高中'
          },
          {
            1: -1000,
            2: 30,
            3: 30,
            4: 30,
            5: 30,
            6: 30,
            7: 30,
            8: 30,
            9: 50,
            10: -1000,
            11: -1000,
            12: 30,
            14: 50,
            name: '大专'
          },
          {
            1: -1000,
            2: 30,
            3: 40,
            4: 40,
            5: 40,
            6: 40,
            7: 40,
            8: 40,
            9: 30,
            10: -1000,
            11: -1000,
            12: 40,
            14: 30,
            name: '本科',
            select: true
          },
          {
            1: -1000,
            2: 30,
            3: 50,
            4: 40,
            5: 50,
            6: 30,
            7: 50,
            8: 30,
            9: -30,
            10: -1000,
            11: -1000,
            12: 50,
            14: -30,
            name: '硕士'
          },
          {
            1: -1000,
            2: 30,
            3: 50,
            4: 40,
            5: 50,
            6: 30,
            7: 50,
            8: 30,
            9: -30,
            10: -1000,
            11: -1000,
            12: 50,
            14: -30,
            name: '博士'
          }
        ],
        name: '学　　历：'
      },
      {
        option: [{
            1: -1000,
            2: 50,
            3: 50,
            4: 50,
            5: 50,
            6: 50,
            7: 50,
            8: 30,
            9: 30,
            10: -1000,
            11: -1000,
            12: 30,
            14: 30,
            name: '男',
            select: true
          },
          {
            1: -1000,
            2: 50,
            3: 30,
            4: 30,
            5: 10,
            6: -30,
            7: 50,
            8: 50,
            9: 50,
            10: -1000,
            11: -1000,
            12: 50,
            14: 50,
            name: '女'
          }
        ],
        name: '性　　别：'
      },
      {
        option: [{
            1: -1000,
            2: 5,
            3: 0,
            4: 0,
            5: -50,
            6: 15,
            7: 20,
            8: 30,
            9: 50,
            10: -1000,
            11: -1000,
            12: 20,
            14: 50,
            name: '18岁以下'
          },
          {
            1: -1000,
            2: 20,
            3: 20,
            4: 20,
            5: 20,
            6: 20,
            7: 20,
            8: 20,
            9: 20,
            10: -1000,
            11: -1000,
            12: 20,
            14: 20,
            name: '18~24岁'
          },
          {
            1: -1000,
            2: 20,
            3: 20,
            4: 20,
            5: 20,
            6: 20,
            7: 20,
            8: 20,
            9: 20,
            10: -1000,
            11: -1000,
            12: 20,
            14: 20,
            name: '25~30岁',
            select: true
          },
          {
            1: -1000,
            2: -30,
            3: -30,
            4: -30,
            5: -30,
            6: -30,
            7: 50,
            8: 0,
            9: 0,
            10: -1000,
            11: -1000,
            12: 50,
            14: -30,
            name: '30岁以上'
          }
        ],
        name: '年　　龄：'
      },
      {
        option: [{
            1: -1000,
            2: 0,
            3: 0,
            4: 0,
            5: 0,
            6: 0,
            7: 0,
            8: 0,
            9: 0,
            10: -1000,
            11: -1000,
            12: 0,
            14: 0,
            name: '无特长',
            select: true
          },
          {
            1: -1000,
            2: 0,
            3: 0,
            4: 0,
            5: 0,
            6: 0,
            7: 0,
            8: 50,
            9: 0,
            10: -1000,
            11: -1000,
            12: 30,
            14: 50,
            name: '绘画基础'
          },
          {
            1: -1000,
            2: 10,
            3: 10,
            4: 10,
            5: 10,
            6: 50,
            7: 0,
            8: 0,
            9: 10,
            10: -1000,
            11: -1000,
            12: 0,
            14: 0,
            name: '网络相关'
          },
          {
            1: -1000,
            2: 0,
            3: 0,
            4: 0,
            5: 0,
            6: 0,
            7: 50,
            8: 30,
            9: 10,
            10: -1000,
            11: -1000,
            12: 30,
            14: 0,
            name: '原型设计'
          },
          {
            1: -1000,
            2: 0,
            3: 0,
            4: 0,
            5: 0,
            6: 0,
            7: 30,
            8: 0,
            9: 0,
            10: -1000,
            11: -1000,
            12: 50,
            14: 0,
            name: '文字功底'
          }
        ],
        name: '特　　长：'
      },
      {
        option: [{
            1: -1000,
            2: 30,
            3: 0,
            4: 0,
            5: 0,
            6: 0,
            7: 30,
            8: 50,
            9: 50,
            10: -1000,
            11: -1000,
            12: 30,
            14: 50,
            name: '无专业'
          },
          {
            1: -1000,
            2: 35,
            3: 35,
            4: 35,
            5: 50,
            6: 40,
            7: 40,
            8: 40,
            9: 30,
            10: -1000,
            11: -1000,
            12: 40,
            14: 30,
            name: '计算机相关'
          },
          {
            1: -1000,
            2: 30,
            3: 35,
            4: 35,
            5: 40,
            6: 30,
            7: 30,
            8: 30,
            9: 30,
            10: -1000,
            11: -1000,
            12: 30,
            14: 0,
            name: '理工科',
            select: true
          },
          {
            1: -1000,
            2: 10,
            3: 10,
            4: 10,
            5: 10,
            6: 10,
            7: 50,
            8: 50,
            9: 30,
            10: -1000,
            11: -1000,
            12: 50,
            14: 20,
            name: '文科'
          }
        ],
        name: '专　　业：'
      },
      {
        option: [{
            1: -1000,
            2: 40,
            3: 10,
            4: 10,
            5: 10,
            6: 10,
            7: 20,
            8: 50,
            9: 50,
            10: -1000,
            11: -1000,
            12: 20,
            14: 30,
            name: '渣渣'
          },
          {
            1: -1000,
            2: 30,
            3: 30,
            4: 30,
            5: 30,
            6: 30,
            7: 30,
            8: 30,
            9: 30,
            10: -1000,
            11: -1000,
            12: 30,
            14: 50,
            name: '普通',
            select: true
          },
          {
            1: -1000,
            2: 40,
            3: 40,
            4: 40,
            5: 50,
            6: 40,
            7: 30,
            8: 0,
            9: 0,
            10: -1000,
            11: -1000,
            12: 30,
            14: 10,
            name: '卓越'
          }
        ],
        name: '逻　　辑：'
      },
      {
        option: [{
            1: -1000,
            2: 50,
            3: 50,
            4: 50,
            5: 50,
            6: 50,
            7: -10,
            8: 0,
            9: 0,
            10: -1000,
            11: -1000,
            12: -10,
            14: 20,
            name: '沉默寡言'
          },
          {
            1: -1000,
            2: 0,
            3: 0,
            4: 0,
            5: 0,
            6: 0,
            7: 0,
            8: 0,
            9: 0,
            10: -1000,
            11: -1000,
            12: 0,
            14: 30,
            name: '中规中矩',
            select: true
          },
          {
            1: -1000,
            2: 0,
            3: 0,
            4: 0,
            5: 0,
            6: 0,
            7: 50,
            8: 50,
            9: 0,
            10: -1000,
            11: -1000,
            12: 50,
            14: 50,
            name: '开朗活泼'
          }
        ],
        name: '性　　格：'
      },
      {
        option: [{
            1: -1000,
            2: 50,
            3: 40,
            4: 40,
            5: 40,
            6: 0,
            7: 30,
            8: 30,
            9: 20,
            10: -1000,
            11: -1000,
            12: 30,
            14: 50,
            name: '所见即所得'
          },
          {
            1: -1000,
            2: 30,
            3: 30,
            4: 30,
            5: 30,
            6: 30,
            7: 30,
            8: 30,
            9: 30,
            10: -1000,
            11: -1000,
            12: 30,
            14: 0,
            name: '抽象推理',
            select: true
          }
        ],
        name: '偏　　好：'
      },
      {
        option: [{
            1: -1000,
            2: 0,
            3: 0,
            4: 0,
            5: 0,
            6: 0,
            7: 50,
            8: 0,
            9: 50,
            10: -1000,
            11: -1000,
            12: 50,
            14: 0,
            name: '喜欢'
          },
          {
            1: -1000,
            2: 50,
            3: 50,
            4: 50,
            5: 50,
            6: 50,
            7: -30,
            8: 50,
            9: 0,
            10: -1000,
            11: -1000,
            12: -30,
            14: 30,
            name: '不喜欢',
            select: true
          }
        ],
        name: '社　　交：'
      }
    ]
  },

  // 绑定事件，因为不能用this.setData直接设置每个对象的索引值index。
  // 所以用自定义属性current来标记每个数组对象的下标
  bindPickerChange: function(e) {

    // 定义一个变量curindex 储存触发事件的数组对象的下标
    const curindex = e.target.dataset.current;
    // 根据下标 改变该数组对象中的index值
    this.data.score[curindex].index = e.detail.value;
    // console.log(curindex);
    this.setData({
      // 把改变某个数组对象index值之后的全新score重新 赋值给score
      score: this.data.score,
    })
  },
 
  goTest: function() {
    let select = [];
    for (let i = 0; i < 9; i++) {
      select.push(this.data.score[i].option[this.data.score[i].index]);
    }
    console.log(select);
    let weight = [];
    for (let i = 0; i < 12; i++) {
      weight[i] = {
        // num为职业数组中对应职业的id scroe为权重
        num:i+1,
        score: select[0][i+1] + select[1][i+1] + select[2][i+1] + select[3][i+1] + select[4][i+1] + select[5][i+1] + select[6][i+1] + select[7][i+1] + select[8][i+1]
      }
    }
    
    weight.sort(function(a,b){
      return b.score-a.score
    });
    console.log(weight);
    let recommand=[];
    for(let i=0;i<3;i++){
      recommand[i]=weight[i].num;
    }
    console.log(recommand)
    wx.setStorage({
      key: "recommand",
      data: recommand
    })
  },
  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function(options) {
    this.data.score.map(item => {
      item.index = 0
    })
    this.setData({
      score: this.data.score,
    })
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function() {

  }
})